# Week 9 Lab: Lists, Dictionaries, and Panda
This week’s lab gives you practical experience with data analysis in Python.

You will:
- Traverse lists using for loops and the accumulator pattern
- Use dictionaries to represent structured data and practice common iteration patterns
- Load, access, and explore data using pandas DataFrames

**Instructions**
- Work through the problems in order.
- Write tests where indicated and run them to verify your progress.

#### Run the cell below once to set up the test environment.

In [ ]:
import piplite
await piplite.install(["pytest", "ipytest"])

import ipytest
ipytest.autoconfig()

## Problem 1: Movie Ratings Dashboard 
**Focus:** Lists, loops, accumulator pattern, dictionaries

You are designing a simple analytics utility for a movie review site.

### Task 1.1 – Summing and Averaging Ratings
Implement `average_rating(ratings)` to compute the mean rating (return `0.0` for empty lists). Use a **loop + accumulator**. (avoid using sum()/len() directly for practice). 

**Write some test cases.**

In [32]:
%%ipytest -qq
# Implement using a loop + accumulator

def average_rating(ratings: list[float]) -> float:
    # TODO: replace the placeholder implementation below
    total = 0
    count = 0
    for item in ratings:
        total += ratings[count]
        count += 1
    return (total / count)
    pass

def testAverageRating():
    assert average_rating([1,3,5,7,9,3]) == (1+3+5+7+9+3)/6

.                                                                                            [100%]

### Use the Below Movie Ratings Dictionary for the Next Two Tasks

In [6]:
movie_ratings = {
    "Inception": [5, 4, 5, 5, 4],
    "Avatar": [4, 3, 4, 4],
    "Titanic": [5, 5, 4, 5],
    "Joker": [3, 3.5, 4]
}
movie_ratings

{'Inception': [5, 4, 5, 5, 4],
 'Avatar': [4, 3, 4, 4],
 'Titanic': [5, 5, 4, 5],
 'Joker': [3, 3.5, 4]}

### Task 1.2 – Compute Average Ratings per Movie
Implement `print_movie_averages(movies)` that iterates and prints each movie with its average rating using your function from Task 1.1.

In [40]:
def print_movie_averages(movies: dict[str, list[float]]) -> None:
    # TODO: iterate over items and print each movie with its average rating. 
    # You can use an f-string to format your printed output: f"{title}: {avg:.2f}"
    for value in movies:
        print(f"{value}: {average_rating(movies[value])}")
    pass

# Call your function to preview
print_movie_averages(movie_ratings)

Inception: 4.6
Avatar: 3.75
Titanic: 4.75
Joker: 3.5

### Task 1.3 – Reverse Engineering a Function
Implement a function `filter_by_threshold(movies, threshold)` so that all tests in the next cell pass.

In [52]:
def filter_by_threshold(movies: dict[str, list[float]], threshold: float) -> list[str]:
        r = []
        for values in movies:
                if average_rating(movies[values]) > threshold:
                        r.append(values)
        return r
pass

In [53]:
%%ipytest -qq

def test_filter_by_threshold():
    assert filter_by_threshold(movie_ratings, 4.0) == ['Inception', 'Titanic']
    assert filter_by_threshold(movie_ratings, 4.6) == ['Titanic']
    assert filter_by_threshold(movie_ratings, 3.0) == ['Inception', 'Avatar', 'Titanic', 'Joker']

.                                                                                            [100%]

---
## Problem 2: Pandas (Rows, Columns, Basic Analysis)

You will practice **exactly** the core operations from the lecture:
- `pd.read_csv`
- `head()` / `tail()`
- Row access with `iloc` (including slicing)
- Column access with `orders['column']`
- Series operations: `.mean()`, `.sum()`, `.unique()`

Dataset: **`retail_orders.csv`** (coffee shop sales)

**Columns:** `order_id, date, branch, item, size, quantity, unit_price, order_type, payment_method`

### Load the data

Use `pd.read_csv` and preview the first few rows.

In [10]:
import pandas as pd
orders = pd.read_csv('retail_orders.csv')
orders.head()

,order_id,date,branch,item,size,quantity,unit_price,order_type,payment_method
0,1001,2023-07-01,Riverside,Sandwich,S,1,4.5,dine-in,card
1,1002,2023-07-01,Riverside,Cappuccino,S,4,3.0,dine-in,card
2,1003,2023-07-01,City Centre,Tea,M,1,2.2,takeout,app
3,1004,2023-07-01,University,Latte,L,3,4.3,dine-in,app
4,1005,2023-07-01,City Centre,Tea,M,1,2.2,takeout,card

### Task 2.1 - Row and Column access
1. Show rows **5 to 9** (remember slicing excludes the end index).
2. Show every **10th** row starting at 0.
3. Show the **last row** using negative indexing with `iloc`.
4. Get the `quantity` column as a Series and show the first 8 values.
5. Get the **unique** values of `order_type`.

In [62]:
# TODO: 1 Rows 5 to 9
orders.iloc[5:10]

,order_id,date,branch,item,size,quantity,unit_price,order_type,payment_method
5,1006,2023-07-01,University,Tea,S,1,1.8,takeout,card
6,1007,2023-07-01,University,Sandwich,M,4,4.5,dine-in,card
7,1008,2023-07-01,City Centre,Sandwich,S,3,4.5,dine-in,card
8,1009,2023-07-02,University,Tea,S,4,1.8,dine-in,card
9,1010,2023-07-02,City Centre,Cappuccino,L,1,4.1,dine-in,app

In [64]:
# TODO: 2 Every 10th row
orders.iloc[0::10]

,order_id,date,branch,item,size,quantity,unit_price,order_type,payment_method
0,1001,2023-07-01,Riverside,Sandwich,S,1,4.5,dine-in,card
10,1011,2023-07-02,University,Americano,M,4,2.9,takeout,app
20,1021,2023-07-03,City Centre,Latte,S,2,3.2,dine-in,card
30,1031,2023-07-04,Riverside,Espresso,M,3,2.6,takeout,card
40,1041,2023-07-05,University,Tea,L,1,2.6,takeout,card
50,1051,2023-07-06,Riverside,Muffin,S,2,2.4,dine-in,cash
60,1061,2023-07-07,Riverside,Tea,S,2,1.8,dine-in,app
70,1071,2023-07-08,City Centre,Cappuccino,M,2,3.6,dine-in,card
80,1081,2023-07-09,City Centre,Bagel,S,4,2.8,dine-in,card
90,1091,2023-07-11,City Centre,Americano,S,4,2.5,dine-in,card
100,1101,2023-07-12,University,Bagel,M,2,2.8,dine-in,card
110,1111,2023-07-13,City Centre,Espresso,S,1,2.2,dine-in,app
120,1121,2023-07-14,City Centre,Latte,S,2,3.2,takeout,card
130,1131,2023-07-15,University,Latte,M,1,3.8,delivery,app
140,1141,2023-07-16,Riverside,Sandwich,L,3,4.5,dine-in,card
150,1151,2023-07-18,City Centre,Cappuccino,L,4,4.1,dine-in,app
160,1161,2023-07-19,University,Americano,M,4,2.9,dine-in,card
170,1171,2023-07-20,City Centre,Americano,M,3,2.9,takeout,card

In [65]:
# TODO: 3 Last row
orders.tail(3)

,order_id,date,branch,item,size,quantity,unit_price,order_type,payment_method
173,1174,2023-07-20,Riverside,Bagel,M,2,2.8,takeout,card
174,1175,2023-07-20,University,Cappuccino,S,3,3.0,delivery,card
175,1176,2023-07-20,University,Espresso,M,4,2.6,takeout,card

In [71]:
# TODO: 4 Quantity first 8
print(orders["quantity"].head(8))

0    1
1    4
2    1
3    3
4    1
5    1
6    4
7    3
Name: quantity, dtype: int64

In [69]:
# TODO: 5 Unique order_type
print(orders["order_type"].unique())

['dine-in' 'takeout' 'delivery']

### Task 2.2 - Create a derived column
Create `total_price = quantity * unit_price` using simple arithmetic. Then preview with `head()`.

In [74]:
# TODO: Create total_price column then preview
for values in orders:
    orders["total_price"] = orders["quantity"] * orders["unit_price"]

orders.head()

,order_id,date,branch,item,size,quantity,unit_price,order_type,payment_method,total_price
0,1001,2023-07-01,Riverside,Sandwich,S,1,4.5,dine-in,card,4.5
1,1002,2023-07-01,Riverside,Cappuccino,S,4,3.0,dine-in,card,12.0
2,1003,2023-07-01,City Centre,Tea,M,1,2.2,takeout,app,2.2
3,1004,2023-07-01,University,Latte,L,3,4.3,dine-in,app,12.9
4,1005,2023-07-01,City Centre,Tea,M,1,2.2,takeout,card,2.2

### Task 2.3 - Basic analyses using column selection and Series methods
Use `Boolean` filters inside []. Also use Series methods: `.sum()`/`.mean()`/`.unique()`:<br>
- **Total quantity** sold for the item `'Latte'` (e.g., `orders[orders['item'] == 'Latte']['quantity'].sum()`).<br>
    - `orders['item'] == 'Latte'`: This expression creates a Boolean Series (a list of True/False values), one per row.
    - `orders[orders['item'] == 'Latte']`: This uses Boolean indexing to filter the DataFrame, keeping only the rows where the condition is True.
    - `['quantity']`: From that filtered DataFrame, you now select just the 'quantity' column.
- **Average quantity** for orders with `order_type == 'takeout'`.<br>
- **Unique** items sold at the `'University'` branch.

**Windowed comparisons:** 
<br>
- For rows **0 – 24**, compute the **mean quantity**.<br>
- For rows **25 – 49**, compute the **mean quantity**.<br>
- Which window has the higher mean?

In [78]:
# TODO: Total quantity for Latte 
orders[orders['item'] == 'Latte']['quantity'].sum()

np.int64(106)

In [80]:
# TODO: Mean quantity for takeout
orders[orders['order_type'] == 'takeout']['quantity'].mean()

np.float64(2.5238095238095237)

In [83]:
# TODO: Unique items at University
orders["item"].unique()

array(['Sandwich', 'Cappuccino', 'Tea', 'Latte', 'Americano', 'Salad',
       'Bagel', 'Muffin', 'Espresso'], dtype=object)

In [91]:
# TODO: Compute window means and compare
orders.iloc[0:25]["quantity"].mean()

np.float64(2.48)

In [93]:
orders.iloc[25:50]["quantity"].mean()

np.float64(2.36)

In [94]:
# Rows 0 - 24 have a greater mean